import type { SubCategory } from '../../types';

export const pcUpgradesSubCategories: SubCategory[] = [
  {
    id: 'pc-upgrades-questions-list',
    text: 'שאלות על שדרוג המחשב',
    questions: [
      { id: 'q-pchw-u-1', text: 'איך אני יודע אם המחשב שלי זקוק לשדרוג?' },
      { id: 'q-pchw-u-2', text: 'מהו השדרוג הראשון שכדאי לעשות כדי לשפר את מהירות המחשב?' },
      { id: 'q-pchw-u-3', text: 'איך אני מוסיף עוד זיכרון RAM למחשב שלי?' },
      { id: 'q-pchw-u-4', text: 'האם כדאי להחליף את הכונן הקשיח הישן שלי ב-SSD?' },
      { id: 'q-pchw-u-5', text: 'האם אני יכול לשדרג את המעבד (CPU) במחשב שלי?' },
      { id: 'q-pchw-u-6', text: 'האם כדאי לשדרג את כרטיס המסך?' },
      { id: 'q-pchw-u-7', text: 'האם אפשר לשדרג מחשב נייד?' },
      { id: 'q-pchw-u-8', text: 'מתי עדיף לקנות מחשב חדש במקום לשדרג?' },
      { id: 'q-pchw-u-9', text: 'איך אני יודע אילו רכיבים מתאימים למחשב שלי?' },
      { id: 'q-pchw-u-10', text: 'איך אני מוצא טכנאי אמין שיבצע את השדרוג?' },
      { id: 'q-pchw-u-11', text: 'כמה עולה בערך לשדרג מחשב?' },
      { id: 'q-pchw-u-12', text: 'איך אני מעביר את כל הקבצים שלי לכונן החדש?' },
      { id: 'q-pchw-u-13', text: 'האם אני צריך להתקין מחדש את ווינדוס אחרי שדרוג?' },
      { id: 'q-pchw-u-14', text: 'האם אני יכול לשדרג את המסך של המחשב הנייד?' },
      { id: 'q-pchw-u-15', text: 'איך אני משדרג את מערכת ההפעלה שלי לגרסה חדשה יותר?' },
      { id: 'q-pchw-u-16', text: 'מהם היתרונות של שדרוג ספק הכוח?' },
      { id: 'q-pchw-u-17', text: 'האם כדאי לקנות רכיבים משומשים?' },
      { id: 'q-pchw-u-18', text: 'איך אני יכול לבצע את השדרוג בעצמי?' },
      { id: 'q-pchw-u-19', text: 'מה לעשות עם הרכיבים הישנים שלי?' },
      { id: 'q-pchw-u-20', text: 'איך אני בודק אם השדרוג הצליח?' },
      { id: 'q-pchw-u-21', text: 'האם שדרוג מבטל את אחריות היצרן?' },
      { id: 'q-pchw-u-22', text: 'איך אני יכול לשדרג את חיבורי ה-USB שלי?' },
      { id: 'q-pchw-u-23', text: 'האם כדאי להוסיף כונן דיסקים למחשב שאין לו?' },
      { id: 'q-pchw-u-24', text: 'איך אני משדרג את כרטיס הרשת האלחוטי (Wi-Fi)?' },
    ],
  },
];